susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32G49x.h
#define I2C2_SCL_PA9_ PA9,GPIO_AF4
#define I2C2_SCL_PC4_ PC4,GPIO_AF4
#define _I2C2_SCL_PA9_ 1
#define _I2C2_SCL_PC4_ 1

#define I2C2_SDA_PA8_ PA8,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define _I2C2_SDA_PA8_ 1
#define _I2C2_SDA_PF0_ 1

#define I2C2_SMBA_PA10_ PA10,GPIO_AF4
#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define I2C2_SMBA_PF2_ PF2,GPIO_AF4
#define _I2C2_SMBA_PA10_ 1
#define _I2C2_SMBA_PB12_ 1
#define _I2C2_SMBA_PF2_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF2
#define I2C3_SCL_PC8_ PC8,GPIO_AF8
#define _I2C3_SCL_PA8_ 1
#define _I2C3_SCL_PC8_ 1

#define I2C3_SDA_PB5_ PB5,GPIO_AF8
#define I2C3_SDA_PC11_ PC11,GPIO_AF8
#define I2C3_SDA_PC9_ PC9,GPIO_AF8
#define _I2C3_SDA_PB5_ 1
#define _I2C3_SDA_PC11_ 1
#define _I2C3_SDA_PC9_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF2
#define I2C3_SMBA_PB2_ PB2,GPIO_AF4
#define _I2C3_SMBA_PA9_ 1
#define _I2C3_SMBA_PB2_ 1

#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PF1_ PF1,GPIO_AF5
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PF1_ 1

#define I2S2_MCK_PA8_ PA8,GPIO_AF5
#define I2S2_MCK_PC6_ PC6,GPIO_AF6
#define _I2S2_MCK_PA8_ 1
#define _I2S2_MCK_PC6_ 1

#define I2S2_SD_PA11_ PA11,GPIO_AF5
#define I2S2_SD_PB15_ PB15,GPIO_AF5
#define _I2S2_SD_PA11_ 1
#define _I2S2_SD_PB15_ 1

#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PF0_ PF0,GPIO_AF5
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PF0_ 1

#define I2S3_CK_PB3_ PB3,GPIO_AF6
#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define _I2S3_CK_PB3_ 1
#define _I2S3_CK_PC10_ 1

#define I2S3_MCK_PA9_ PA9,GPIO_AF5
#define I2S3_MCK_PC7_ PC7,GPIO_AF6
#define _I2S3_MCK_PA9_ 1
#define _I2S3_MCK_PC7_ 1

#define I2S3_SD_PB5_ PB5,GPIO_AF6
#define I2S3_SD_PC12_ PC12,GPIO_AF6
#define _I2S3_SD_PB5_ 1
#define _I2S3_SD_PC12_ 1

#define I2S3_WS_PA15_ PA15,GPIO_AF6
#define I2S3_WS_PA4_ PA4,GPIO_AF6
#define _I2S3_WS_PA15_ 1
#define _I2S3_WS_PA4_ 1

#define I2S_CKIN_PA12_ PA12,GPIO_AF5
#define I2S_CKIN_PC9_ PC9,GPIO_AF5
#define _I2S_CKIN_PA12_ 1
#define _I2S_CKIN_PC9_ 1

#define IR_OUT_PA13_ PA13,GPIO_AF5
#define IR_OUT_PB9_ PB9,GPIO_AF6
#define _IR_OUT_PA13_ 1
#define _IR_OUT_PB9_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF11
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF11
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF11
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1

#define LPTIM1_OUT_PA14_ PA14,GPIO_AF1
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF1
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF1
#define _LPTIM1_OUT_PA14_ 1
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PC1_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF12
#define LPUART1_CTS_PB13_ PB13,GPIO_AF8
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF12
#define LPUART1_DE_PB12_ PB12,GPIO_AF8
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF12
#define LPUART1_RTS_PB12_ PB12,GPIO_AF8
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1

#define LPUART1_RX_PA3_ PA3,GPIO_AF12
#define LPUART1_RX_PB10_ PB10,GPIO_AF8
#define LPUART1_RX_PC0_ PC0,GPIO_AF8
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB10_ 1
#define _LPUART1_RX_PC0_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF12
#define LPUART1_TX_PB11_ PB11,GPIO_AF8
#define LPUART1_TX_PC1_ PC1,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PC1_ 1

#define QUADSPI1_BK1_IO0_PB1_ PB1,GPIO_AF10
#define QUADSPI1_BK1_IO0_PE12_ PE12,GPIO_AF10
#define _QUADSPI1_BK1_IO0_PB1_ 1
#define _QUADSPI1_BK1_IO0_PE12_ 1

#define QUADSPI1_BK1_IO1_PB0_ PB0,GPIO_AF10
#define QUADSPI1_BK1_IO1_PE13_ PE13,GPIO_AF10
#define QUADSPI1_BK1_IO1_PF9_ PF9,GPIO_AF10
#define _QUADSPI1_BK1_IO1_PB0_ 1
#define _QUADSPI1_BK1_IO1_PE13_ 1
#define _QUADSPI1_BK1_IO1_PF9_ 1

#define QUADSPI1_BK1_IO2_PA7_ PA7,GPIO_AF10
#define QUADSPI1_BK1_IO2_PE14_ PE14,GPIO_AF10
#define _QUADSPI1_BK1_IO2_PA7_ 1
#define _QUADSPI1_BK1_IO2_PE14_ 1

#define QUADSPI1_BK1_IO3_PA6_ PA6,GPIO_AF10
#define QUADSPI1_BK1_IO3_PE15_ PE15,GPIO_AF10
#define _QUADSPI1_BK1_IO3_PA6_ 1
#define _QUADSPI1_BK1_IO3_PE15_ 1

#define QUADSPI1_BK1_NCS_PA2_ PA2,GPIO_AF10
#define QUADSPI1_BK1_NCS_PB11_ PB11,GPIO_AF10
#define QUADSPI1_BK1_NCS_PE11_ PE11,GPIO_AF10
#define _QUADSPI1_BK1_NCS_PA2_ 1
#define _QUADSPI1_BK1_NCS_PB11_ 1
#define _QUADSPI1_BK1_NCS_PE11_ 1

#define QUADSPI1_BK2_IO0_PC1_ PC1,GPIO_AF10
#define QUADSPI1_BK2_IO0_PD4_ PD4,GPIO_AF10
#define _QUADSPI1_BK2_IO0_PC1_ 1
#define _QUADSPI1_BK2_IO0_PD4_ 1

#define QUADSPI1_BK2_IO1_PB2_ PB2,GPIO_AF10
#define QUADSPI1_BK2_IO1_PC2_ PC2,GPIO_AF10
#define QUADSPI1_BK2_IO1_PD5_ PD5,GPIO_AF10
#define _QUADSPI1_BK2_IO1_PB2_ 1
#define _QUADSPI1_BK2_IO1_PC2_ 1
#define _QUADSPI1_BK2_IO1_PD5_ 1

#define QUADSPI1_BK2_IO2_PC3_ PC3,GPIO_AF10
#define QUADSPI1_BK2_IO2_PD6_ PD6,GPIO_AF10
#define _QUADSPI1_BK2_IO2_PC3_ 1
#define _QUADSPI1_BK2_IO2_PD6_ 1

#define QUADSPI1_BK2_IO3_PC4_ PC4,GPIO_AF10
#define QUADSPI1_BK2_IO3_PD7_ PD7,GPIO_AF10
#define _QUADSPI1_BK2_IO3_PC4_ 1
#define _QUADSPI1_BK2_IO3_PD7_ 1

#define QUADSPI1_BK2_NCS_PD3_ PD3,GPIO_AF10
#define _QUADSPI1_BK2_NCS_PD3_ 1

#define QUADSPI1_CLK_PA3_ PA3,GPIO_AF10
#define QUADSPI1_CLK_PB10_ PB10,GPIO_AF10
#define QUADSPI1_CLK_PE10_ PE10,GPIO_AF10
#define QUADSPI1_CLK_PF10_ PF10,GPIO_AF10
#define _QUADSPI1_CLK_PA3_ 1
#define _QUADSPI1_CLK_PB10_ 1
#define _QUADSPI1_CLK_PE10_ 1
#define _QUADSPI1_CLK_PF10_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define RCC_MCO_PG10_ PG10,GPIO_AF0
#define _RCC_MCO_PA8_ 1
#define _RCC_MCO_PG10_ 1

#define RTC_OUT2_PB2_ PB2,GPIO_AF0
#define _RTC_OUT2_PB2_ 1

#define RTC_REFIN_PA1_ PA1,GPIO_AF0
#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PA1_ 1
#define _RTC_REFIN_PB15_ 1

#define SAI1_CK1_PA3_ PA3,GPIO_AF3
#define SAI1_CK1_PB8_ PB8,GPIO_AF3
#define SAI1_CK1_PE2_ PE2,GPIO_AF3
#define _SAI1_CK1_PA3_ 1
#define _SAI1_CK1_PB8_ 1
#define _SAI1_CK1_PE2_ 1

#define SAI1_CK2_PA8_ PA8,GPIO_AF12
#define SAI1_CK2_PE5_ PE5,GPIO_AF3
#define _SAI1_CK2_PA8_ 1
#define _SAI1_CK2_PE5_ 1

#define SAI1_D1_PA10_ PA10,GPIO_AF12
#define SAI1_D1_PC3_ PC3,GPIO_AF3
#define SAI1_D1_PD6_ PD6,GPIO_AF3
#define SAI1_D1_PE6_ PE6,GPIO_AF3
#define _SAI1_D1_PA10_ 1
#define _SAI1_D1_PC3_ 1
#define _SAI1_D1_PD6_ 1
#define _SAI1_D1_PE6_ 1

#define SAI1_D2_PB9_ PB9,GPIO_AF3
#define SAI1_D2_PE4_ PE4,GPIO_AF3
#define _SAI1_D2_PB9_ 1
#define _SAI1_D2_PE4_ 1

